# Formulaes list: https://formulae.brew.sh/cask/
# To fresh up the information of installed casks:
# brew list
# brew list --cask
# mas list

### Main Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

### Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

###############################
## GNU Tools                 ##
###############################

# As documented in: https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
# and: https://gist.github.com/xuhdev/8b1b16fb802f6870729038ce3789568f
# Install GNU core utilities (those that come with OS X are outdated)

# Core GNU
brew 'coreutils'

# GNU key commands
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils' # Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'screen'
brew 'watch'
brew 'wdiff'
brew 'wget'

# OS X ships a GNU version, but too old
brew 'bash'
# brew 'emacs'
# brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.
brew 'gpatch'
# brew 'm4'
brew 'make'
brew 'nano'

# Other commands (non-GNU)
brew 'file-formula'
brew 'git'
brew 'diff-so-fancy'
brew 'less'
# brew 'openssh'
# brew 'perl'
brew 'python@3.9'
brew 'rsync'
# brew 'svn'
brew 'unzip'
# brew 'vim'
# brew 'macvim'
brew 'zsh'
# brew 'starship'           # Alternative to Powerlevel10K https://www.reddit.com/r/zsh/comments/10k0g93/comment/j5nvac2/?utm_source=share&utm_medium=web2x&context=3

# Other commands (personal)
# brew 'awk'
brew 'neovim'
brew 'tree'
brew 'tmux'
# brew 'rename'
brew 'midnight-commander'
brew 'lcdf-typetools' # Font Utilities
brew 'fontconfig' # Font Utilities
brew 'fontforge'

###############################
## Software Development      ##
###############################

### Github Utilities
brew 'hub'
tap 'microsoft/git'
cask 'microsoft/git/git-credential-manager-core' # Requieres Password # https://github.com/GitCredentialManager/git-credential-manager

### AWS
# brew 'awscli'

### NodeJS
# brew 'node'

### PHP
# brew 'homebrew/php/php70', args: ['with-debug', 'without-apache']

### Java
# brew 'java'
brew 'openjdk@8'
# brew 'openjdk@11'
# brew 'openjdk@17'

### Containers & Virtualization
# cask 'docker'

###############################
## Other Tools               ##
###############################

### System Utilities
brew 'mackup'
tap 'buo/cask-upgrade' # https://github.com/buo/homebrew-cask-upgrade

### Oh-My-Zsh themes and plugins
tap 'romkatv/powerlevel10k'
brew 'powerlevel10k'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
# brew 'zsh-completions' # To enable check: https://formulae.brew.sh/formula/zsh-completions#default

###############################
## Fonts                     ##
###############################

### Public Fonts
# cask 'font-inter'
# cask 'font-lato'

### Personal Collection

tap 'alejakun/cask'

cask 'alejakun/cask/font-agrevuecyr-roman'
cask 'alejakun/cask/font-bankgothic-bold'
cask 'alejakun/cask/font-bankgothic-regular'
cask 'alejakun/cask/font-bebas-neue-pro'
cask 'alejakun/cask/font-bebas-neue'
cask 'alejakun/cask/font-bebas'
cask 'alejakun/cask/font-benton-sans'
cask 'alejakun/cask/font-caviar-dreams'
cask 'alejakun/cask/font-cc-ultimatum'
cask 'alejakun/cask/font-fette-engschrift'
cask 'alejakun/cask/font-ff-good-pro-cond'
cask 'alejakun/cask/font-gotham'
cask 'alejakun/cask/font-harry-p'
cask 'alejakun/cask/font-marvel'
cask 'alejakun/cask/font-myriad-pro'
cask 'alejakun/cask/font-neoprint-m319'
cask 'alejakun/cask/font-rubber-stamp'
cask 'alejakun/cask/font-tengwar-annatar'
cask 'alejakun/cask/font-top-secret'

cask 'alejakun/cask/font-prog-apl386-nerd-font'
cask 'alejakun/cask/font-prog-average-mono-nerd-font'
cask 'alejakun/cask/font-prog-bp-mono-nerd-font'
cask 'alejakun/cask/font-prog-bront-nerd-font'
cask 'alejakun/cask/font-prog-calling-code-nerd-font'
cask 'alejakun/cask/font-prog-camingo-code-nerd-font'
cask 'alejakun/cask/font-prog-cmu-typewriter-nerd-font'
cask 'alejakun/cask/font-prog-code-new-roman-nerd-font'
cask 'alejakun/cask/font-prog-coding-font-tobi-nerd-font'
cask 'alejakun/cask/font-prog-consola-mono-nerd-font'
cask 'alejakun/cask/font-prog-consolas-nerd-font'
cask 'alejakun/cask/font-prog-courier-prime-code-nerd-font'
cask 'alejakun/cask/font-prog-cp-mono-v07-nerd-font'
cask 'alejakun/cask/font-prog-crisp-nerd-font'
cask 'alejakun/cask/font-prog-cutive-mono-nerd-font'
cask 'alejakun/cask/font-prog-dank-mono-nerd-font'
cask 'alejakun/cask/font-prog-dina-nerd-font'
cask 'alejakun/cask/font-prog-edlo-nerd-font'
cask 'alejakun/cask/font-prog-envy-code-r-nerd-font'
cask 'alejakun/cask/font-prog-fantasque-sans-mono-nerd-font'
cask 'alejakun/cask/font-prog-fixed-sys-excelsior-nerd-font'
cask 'alejakun/cask/font-prog-free-mono-nerd-font'
cask 'alejakun/cask/font-prog-generic-nerd-font'
cask 'alejakun/cask/font-prog-gintronic-nerd-font'
cask 'alejakun/cask/font-prog-inconsolata-nerd-font'
cask 'alejakun/cask/font-prog-input-mono-nerd-font'
cask 'alejakun/cask/font-prog-input-sans-nerd-font'
cask 'alejakun/cask/font-prog-input-serif-nerd-font'
cask 'alejakun/cask/font-prog-kawkab-mono-nerd-font'
cask 'alejakun/cask/font-prog-latin-modern-mono-nerd-font'
cask 'alejakun/cask/font-prog-linux-libertine-mono-nerd-font'
cask 'alejakun/cask/font-prog-luculent-nerd-font'
cask 'alejakun/cask/font-prog-luxi-mono-nerd-font'
cask 'alejakun/cask/font-prog-mensch-nerd-font'
cask 'alejakun/cask/font-prog-meslo-lgs-nerd-font'
cask 'alejakun/cask/font-prog-metrickal-nerd-font'
cask 'alejakun/cask/font-prog-monaco-for-powerline-nerd-font'
cask 'alejakun/cask/font-prog-mono-lisa-nerd-font'
cask 'alejakun/cask/font-prog-mono-one-nerd-font'
cask 'alejakun/cask/font-prog-mono-spatial-nerd-font'
cask 'alejakun/cask/font-prog-monospace-nerd-font'
cask 'alejakun/cask/font-prog-monospace-typewriter-nerd-font'
cask 'alejakun/cask/font-prog-monte-carlo-nerd-font'
cask 'alejakun/cask/font-prog-nanum-gothic-coding-nerd-font'
cask 'alejakun/cask/font-prog-nimbus-mono-nerd-font'
cask 'alejakun/cask/font-prog-not-courier-sans-nerd-font'
cask 'alejakun/cask/font-prog-office-code-pro-nerd-font'
cask 'alejakun/cask/font-prog-operator-mono-nerd-font'
cask 'alejakun/cask/font-prog-oxygen-mono-nerd-font'
cask 'alejakun/cask/font-prog-panic-sans-nerd-font'
cask 'alejakun/cask/font-prog-pixel-carnage-nerd-font'
cask 'alejakun/cask/font-prog-pointfree-nerd-font'
cask 'alejakun/cask/font-prog-pragmata-pro-nerd-font'
cask 'alejakun/cask/font-prog-pt-mono-nerd-font'
cask 'alejakun/cask/font-prog-sax-mono-nerd-font'
cask 'alejakun/cask/font-prog-sf-mono-nerd-font'
cask 'alejakun/cask/font-prog-small-type-writing-nerd-font'
cask 'alejakun/cask/font-prog-sudo-nerd-font'
cask 'alejakun/cask/font-prog-sv-basic-manual-nerd-font'
cask 'alejakun/cask/font-prog-tex-gyre-cursor-nerd-font'
cask 'alejakun/cask/font-prog-verily-serif-mono-nerd-font'
cask 'alejakun/cask/font-prog-whois-mono-nerd-font'
